docs/theology/heretics.org
* Valentinus
[[https://www.earlychristianwritings.com/text/valentinian.html][A Valentinian Exposition]]

But I think at least they tried to conform to the image of Christ from what I can divulge, unlike most modern-day Christians.
So, yeah, a lot of modern-day Christianity is probably even more heretical than Valentinianism to be honest.

** Refutations
*** Refutation of All Heresies (Hippolytus)

[[https://www.newadvent.org/fathers/050106.htm][CHURCH FATHERS: Refutation of All Heresies, Book VI {Hippolytus}]]

* WATV - World Mission Society Church of God
- Positives:
  - They believe obedience is important to faith.
- Problems:
  - They believe the Father is the Son exactly
  - They believe in God the Mother
  - They believe Gentiles are under the Mosaic law.

* Free-grace without Lordship salvation
This is a problem in Calvinist churches with people (especially pastors)
who don't preach for us to 'do' the will of God, but merely want God to do it, when Jesus told His disciples to teach people to obey Him.

[[https://www.youtube.com/watch?v=Rvvdx4i2TK8][Why Do So Many Christians Reject Calvinism? - YouTube]]

The truth is we are set free from sin to become slaves of God and the fruit of being a slave to God leads to sanctification and at its end, eternal life:

#+BEGIN_QUOTE
  *Romans 6:22-23* - But now that you have been set free from sin and have become slaves of God, the fruit you get leads to sanctification and its end, eternal life. For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.
#+END_QUOTE

We must keep ourselves in the love of God by obeying Jesus Christ's commandments, because we're awaiting to receive eternal life:

#+BEGIN_QUOTE
  *Jude 1:21* - *keep yourselves in the love of God,* waiting for the mercy of our Lord Jesus Christ that leads to eternal life. (ESV)
#+END_QUOTE

Keeping Jesus Christ's commandments is a requirement to inherit eternal life:

#+BEGIN_QUOTE
  *John 15:10* - *If you keep my commandments, you will abide in my love,* just as I have kept my Father's commandments and abide in his love. (ESV)
#+END_QUOTE

* Lordship salvation without free-grace
I think that actually following Jesus is probably superior to someone who says that they are a follower of Jesus but doesn't actually follow.

#+BEGIN_QUOTE
  *Matthew 21:28-31* - “But what do you think? A man had two sons, and he came to the first and said, ‘Son, go work today in the vineyard.’ And he answered, ‘I will not’; but afterward he regretted it and went.  The man came to the second and said the same thing; and he answered, ‘I will, sir’; but he did not go.  *Which of the two did the will of his father?” They said, “The first.”* Jesus said to them, “Truly I say to you that *the tax collectors and prostitutes will get into the kingdom of God before you.*
#+END_QUOTE

#+BEGIN_QUOTE
  *Matthew 7:21* - Not everyone who says to me, Lord, Lord, will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 15:10* - Just so, I tell you, there is joy before the angels of God over one sinner who repents. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 19:9-10* - And Jesus said to him, Today salvation has come to this house, since he also is a son of Abraham. For the Son of Man came to seek and to save the lost. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *II Peter 3:9* - The Lord is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Matthew 12:50* - For whoever does the will of my Father in heaven is my brother and sister and mother. (ESV)
#+END_QUOTE

