docs/theology/heretics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-18 Mon 17:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8413faa">1. Valentinus</a>
<ul>
<li><a href="#orge694f5e">1.1. Refutations</a>
<ul>
<li><a href="#org4f69c00">1.1.1. Refutation of All Heresies (Hippolytus)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org25e4234">2. WATV - World Mission Society Church of God</a></li>
<li><a href="#org3d432b6">3. Free-grace without Lordship salvation</a></li>
<li><a href="#org777a6b6">4. Lordship salvation without free-grace</a></li>
<li><a href="#org117ea24">5. Can other religions exist anywhere in the Kingdom of God. They have to put their faith in and follow Jesus</a>
<ul>
<li><a href="#org187e24d">5.1. They also have to repent from idolatry</a>
<ul>
<li><a href="#org7072f18">5.1.1. Idolatry</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga663279">6. People who twist the Scriptures to seek worldly prosperity instead of following Jesus</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8413faa" class="outline-2">
<h2 id="org8413faa"><span class="section-number-2">1.</span> Valentinus</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.earlychristianwritings.com/text/valentinian.html">A Valentinian Exposition</a>
</p>
</div>

<div id="outline-container-orge694f5e" class="outline-3">
<h3 id="orge694f5e"><span class="section-number-3">1.1.</span> Refutations</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org4f69c00" class="outline-4">
<h4 id="org4f69c00"><span class="section-number-4">1.1.1.</span> Refutation of All Heresies (Hippolytus)</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<a href="https://www.newadvent.org/fathers/050106.htm">CHURCH FATHERS: Refutation of All Heresies, Book VI {Hippolytus}</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org25e4234" class="outline-2">
<h2 id="org25e4234"><span class="section-number-2">2.</span> WATV - World Mission Society Church of God</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Positives:
<ul class="org-ul">
<li>They believe obedience is important to faith.</li>
</ul></li>
<li>Problems:
<ul class="org-ul">
<li>They believe the Father is the Son exactly</li>
<li>They believe in God the Mother</li>
<li>They believe Gentiles are under the Mosaic law.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3d432b6" class="outline-2">
<h2 id="org3d432b6"><span class="section-number-2">3.</span> Free-grace without Lordship salvation</h2>
<div class="outline-text-2" id="text-3">
<p>
This is a problem in Calvinist churches with people (especially pastors)
who don't preach for us to 'do' the will of God, but merely want God to do it, when Jesus told His disciples to teach people to obey Him.
</p>

<p>
The truth is we are set free from sin to become slaves of God and the fruit of being a slave to God leads to sanctification and at its end, eternal life:
</p>

<blockquote>
<p>
<b>Romans 6:22-23</b> - But now that you have been set free from sin and have become slaves of God, the fruit you get leads to sanctification and its end, eternal life. For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.
</p>
</blockquote>

<p>
We must keep ourselves in the love of God by obeying Jesus Christ's commandments, because we're awaiting to receive eternal life:
</p>

<blockquote>
<p>
<b>Jude 1:21</b> - <b>keep yourselves in the love of God,</b> waiting for the mercy of our Lord Jesus Christ that leads to eternal life. (ESV)
</p>
</blockquote>

<p>
Keeping Jesus Christ's commandments is a requirement to inherit eternal life:
</p>

<blockquote>
<p>
<b>John 15:10</b> - <b>If you keep my commandments, you will abide in my love,</b> just as I have kept my Father's commandments and abide in his love. (ESV)
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org777a6b6" class="outline-2">
<h2 id="org777a6b6"><span class="section-number-2">4.</span> Lordship salvation without free-grace</h2>
<div class="outline-text-2" id="text-4">
<p>
I think that actually following Jesus is probably superior to someone who says that they are a follower of Jesus but doesn't actually follow.
</p>

<blockquote>
<p>
<b>Matthew 21:28-31</b> - “But what do you think? A man had two sons, and he came to the first and said, ‘Son, go work today in the vineyard.’ And he answered, ‘I will not’; but afterward he regretted it and went.  The man came to the second and said the same thing; and he answered, ‘I will, sir’; but he did not go.  <b>Which of the two did the will of his father?” They said, “The first.”</b> Jesus said to them, “Truly I say to you that <b>the tax collectors and prostitutes will get into the kingdom of God before you.</b>
</p>
</blockquote>

<blockquote>
<p>
<b>Matthew 7:21</b> - Not everyone who says to me, Lord, Lord, will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Luke 15:10</b> - Just so, I tell you, there is joy before the angels of God over one sinner who repents. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Luke 19:9-10</b> - And Jesus said to him, Today salvation has come to this house, since he also is a son of Abraham. For the Son of Man came to seek and to save the lost. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>II Peter 3:9</b> - The Lord is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Matthew 12:50</b> - For whoever does the will of my Father in heaven is my brother and sister and mother. (ESV)
</p>
</blockquote>
</div>
</div>
