docs/theology/heretics.html

<div id="outline-container-org117ea24" class="outline-2">
<h2 id="org117ea24"><span class="section-number-2">5.</span> Can other religions exist anywhere in the Kingdom of God. They have to put their faith in and follow Jesus</h2>
<div class="outline-text-2" id="text-5">
<blockquote>
<p>
<b>John 7:24</b> - Do not judge by appearances, but judge with right judgment. (ESV)
</p>
</blockquote>

<p>
It's not really the religion but who puts their faith in Jesus and <b>obeys</b> the gospel who will be saved.
</p>

<p>
Correct Christology is important, but so is obeying Jesus' commandments, and obeying Jesus' commandments is possibly even more important than belief:
</p>

<blockquote>
<p>
<b>Matthew 21:28-31</b> - “But what do you think? A man had two sons, and he came to the first and said, ‘Son, go work today in the vineyard.’ And he answered, ‘I will not’; but afterward he regretted it and went.  The man came to the second and said the same thing; and he answered, ‘I will, sir’; but he did not go.  <b>Which of the two did the will of his father?” They said, “The first.”</b> Jesus said to them, “Truly I say to you that <b>the tax collectors and prostitutes will get into the kingdom of God before you.</b>
</p>
</blockquote>

<p>
We must keep ourselves in the love of God by obeying Jesus Christ's commandments, because we're awaiting to receive eternal life:
</p>

<blockquote>
<p>
<b>Jude 1:21</b> - <b>keep yourselves in the love of God,</b> waiting for the mercy of our Lord Jesus Christ that leads to eternal life. (ESV)
</p>
</blockquote>

<p>
Keeping Jesus Christ's commandments is a requirement to inherit eternal life:
</p>

<blockquote>
<p>
<b>John 15:10</b> - <b>If you keep my commandments, you will abide in my love,</b> just as I have kept my Father's commandments and abide in his love. (ESV)
</p>
</blockquote>

<p>
Whoever truly believes Jesus trusts in and is obedient to Jesus. We must obey Jesus Christ, and that obedience means being a slave of righteousness, leading to sanctification, which leads to eternal life:
</p>

<blockquote>
<p>
<b>John 3:36</b> - Whoever believes in the Son has eternal life; whoever does not obey the Son shall not see life, but the wrath of God remains on him. (ESV)
</p>
</blockquote>

<p>
Therefore, I don't want to flat-out disqualify people who do not have precisely the correct doctrine or theology.
</p>

<p>
Jesus goes to those who hear His voice to bring them into His flock:
</p>

<blockquote>
<p>
<b>John 10:16</b> - And I have other sheep that are not of this fold. I must bring them also, and they will listen to my voice. So there will be one flock, one shepherd. (ESV)
</p>
</blockquote>

<p>
Jesus Christ is God's servant. We are Jesus' servants. It is a kingdom of servants, obedient to God.
</p>

<p>
Not all religions are equal. There is only one true God, the Father of Jesus Christ who has revealed Himself in Jesus Christ.
</p>

<p>
The only way is Jesus:
</p>

<blockquote>
<p>
<b>John 14:6</b> - Jesus said to him, I am the way, and the truth, and the life. No one comes to the Father except through me. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>1 Corinthians 8:5-6</b> - For although there may be so-called gods in heaven or on earth-as indeed there are many gods and many lords- yet for us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. (ESV)
</p>
</blockquote>

<p>
Jesus Himself is the bread of God - Jesus Himself <b>is</b> the source of life:
</p>

<blockquote>
<p>
<b>John 6:33</b> - For the bread of God is he who comes down from heaven and gives life to the world.
</p>
</blockquote>

<blockquote>
<p>
<b>John 6:35</b> - Jesus said to them, I am the bread of life; whoever comes to me shall not hunger, and whoever believes in me shall never thirst.
</p>
</blockquote>

<blockquote>
<p>
<b>John 13:34-35</b> - A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another. By this all people will know that you are my disciples, if you have love for one another. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Galatians 1:6-10</b> - I am astonished that you are so quickly deserting him who called you in the grace of Christ and are turning to a different gospel- not that there is another one, but there are some who trouble you and want to distort the gospel of Christ. But even if we or an angel from heaven should preach to you a gospel contrary to the one we preached to you, let him be accursed. As we have said before, so now I say again: If anyone is preaching to you a gospel contrary to the one you received, let him be accursed. For am I now seeking the approval of man, or of God? Or am I trying to please man? If I were still trying to please man, I would not be a servant of Christ. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>Micah 4:1-13</b> - It shall come to pass in the latter days that the mountain of the house of the LORD shall be established as the highest of the mountains, and it shall be lifted up above the hills; and peoples shall flow to it, and many nations shall come, and say: Come, let us go up to the mountain of the LORD, to the house of the God of Jacob, that he may teach us his ways and that we may walk in his paths. For out of Zion shall go forth the law, and the word of the LORD from Jerusalem. He shall judge between many peoples, and shall decide for strong nations afar off; and they shall beat their swords into plowshares, and their spears into pruning hooks; nation shall not lift up sword against nation, neither shall they learn war anymore; but they shall sit every man under his vine and under his fig tree, and no one shall make them afraid, for the mouth of the LORD of hosts has spoken. For all the peoples walk each in the name of its god, but we will walk in the name of the LORD our God forever and ever. In that day, declares the LORD, I will assemble the lame and gather those who have been driven away and those whom I have afflicted; and the lame I will make the remnant, and those who were cast off, a strong nation; and the LORD will reign over them in Mount Zion from this time forth and forevermore. And you, O tower of the flock, hill of the daughter of Zion, to you shall it come, the former dominion shall come, kingship for the daughter of Jerusalem. Now why do you cry aloud? Is there no king in you? Has your counselor perished, that pain seized you like a woman in labor? Writhe and groan, O daughter of Zion, like a woman in labor, for now you shall go out from the city and dwell in the open country; you shall go to Babylon. There you shall be rescued; there the LORD will redeem you from the hand of your enemies. Now many nations are assembled against you, saying, Let her be defiled, and let our eyes gaze upon Zion. But they do not know the thoughts of the LORD; they do not understand his plan, that he has gathered them as sheaves to the threshing floor. Arise and thresh, O daughter of Zion, for I will make your horn iron, and I will make your hoofs bronze; you shall beat in pieces many peoples; and shall devote their gain to the LORD, their wealth to the Lord of the whole earth. (ESV)
</p>
</blockquote>

<blockquote>
<p>
<b>James 1:26</b> - If anyone thinks he is religious and does not bridle his tongue but deceives his heart, this person's religion is worthless. Religion that is pure and undefiled before God, the Father, is this: to visit orphans and widows in their affliction, and to keep oneself unstained from the world.
</p>
</blockquote>
</div>
