docs/theology/heretics.org
** They also have to repent from idolatry
#+BEGIN_QUOTE
  *I Thessalonians 1:9-10* - For they themselves report concerning us the kind of reception we had among you, and how you turned to God from idols to serve the living and true God, and to wait for his Son from heaven, whom he raised from the dead, Jesus who delivers us from the wrath to come.
#+END_QUOTE

#+BEGIN_QUOTE
  *I Corinthians 10:14-31* - Therefore, my beloved, flee from idolatry. I speak as to sensible people; judge for yourselves what I say. The cup of blessing that we bless, is it not a participation in the blood of Christ? The bread that we break, is it not a participation in the body of Christ? Because there is one bread, we who are many are one body, for we all partake of the one bread. Consider the people of Israel: are not those who eat the sacrifices participants in the altar? What do I imply then? That food offered to idols is anything, or that an idol is anything? No, I imply that what pagans sacrifice they offer to demons and not to God. I do not want you to be participants with demons. *You cannot drink the cup of the Lord and the cup of demons. You cannot partake of the table of the Lord and the table of demons*. Shall we provoke the Lord to jealousy? Are we stronger than he? All things are lawful, but not all things are helpful. All things are lawful, but not all things build up. Let no one seek his own good, but the good of his neighbor. Eat whatever is sold in the meat market without raising any question on the ground of conscience. For the earth is the Lord's, and the fullness thereof. If one of the unbelievers invites you to dinner and you are disposed to go, eat whatever is set before you without raising any question on the ground of conscience. But if someone says to you, This has been offered in sacrifice, then do not eat it, for the sake of the one who informed you, and for the sake of conscience— I do not mean your conscience, but his. For why should my liberty be determined by someone else's conscience? If I partake with thankfulness, why am I denounced because of that for which I give thanks? So, whether you eat or drink, or whatever you do, do all to the glory of God.
#+END_QUOTE

*** Idolatry

#+BEGIN_QUOTE
  *Acts 17:29* - Being then God's offspring, we ought not to think that the divine being is like gold or silver or stone, an image formed by the art and imagination of man.
#+END_QUOTE

#+BEGIN_QUOTE
  *Romans 1:23* - and exchanged the glory of the immortal God for images resembling mortal man and birds and animals and reptiles.􄐺
#+END_QUOTE

#+BEGIN_QUOTE
  *Psalms 106:20* - They exchanged the glory of God for the image of an ox that eats grass.􂉢
#+END_QUOTE

* People who twist the Scriptures to seek worldly prosperity instead of following Jesus
[[https://www.youtube.com/watch?v=lTMcFZJTN78][How Kenneth Copeland Scammed Millions - YouTube]]

#+BEGIN_QUOTE
  *I Timothy 6:6* - Now there is great gain in godliness with contentment, (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Acts 8:20* - But Peter said to him, May your silver perish with you, because you thought you could obtain the gift of God with money! (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *John 12:6* - He said this, not because he cared about the poor, but because he was a thief, and having charge of the moneybag he used to help himself to what was put into it. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 12:33* - Sell your possessions, and give to the needy. Provide yourselves with moneybags that do not grow old, with a treasure in the heavens that does not fail, where no thief approaches and no moth destroys. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 9:3* - And he said to them, Take nothing for your journey, no staff, nor bag, nor bread, nor money; and do not have two tunics. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 16:13* - No servant can serve two masters, for either he will hate the one and love the other, or he will be devoted to the one and despise the other. You cannot serve God and money. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 14:26* - If anyone comes to me and does not hate his own father and mother and wife and children and brothers and sisters, yes, and even his own life, he cannot be my disciple. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *II Timothy 3:2* - For people will be lovers of self, lovers of money, proud, arrogant, abusive, disobedient to their parents, ungrateful, unholy, (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Matthew 6:24* - No one can serve two masters, for either he will hate the one and love the other, or he will be devoted to the one and despise the other. You cannot serve God and money. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 18:25* - For it is easier for a camel to go through the eye of a needle than for a rich person to enter the kingdom of God. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Matthew 6:33* - But seek first the kingdom of God and his righteousness, and all these things will be added to you. (ESV)
#+END_QUOTE
